src/cf/Catalogs/Метрики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Метрики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выражение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальныйМасштаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодЗамеров</Name>
					<Comment>в минутах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодХранения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/ОчередьОбновленияПравДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОчередьОбновленияПравДоступа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВМиллиСекундах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КоличествоПопытокОбработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приоритет</Name>
					<Comment>1 - оперативная очередь, 2 - долгая очередь</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДопСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПротоколРаботыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПротоколРаботыСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныеСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяКомпьютера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектДанных</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПротоколируемыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытийПротоколаРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ДанныеБизнесПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДанныеБизнесПроцессов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВедущаяЗадача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГлавнаяЗадача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерИтерации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектДоступа</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойПредмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроектнаяЗадача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроектныеЗадачи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияБизнесПроцессов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стартован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТрудозатратыПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьУзелОбмена</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>БизнесПроцесс</Name>
					<Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Завершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СостоянияБизнесПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияБизнесПроцессов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Активен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Остановлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прерван</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/Метрики/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет реквизиты предопределенных элементов.
// 
Процедура ЗаполнитьПредопределенные() Экспорт
	
	// Заполнение настроек метрик
	СвойстваМетрикПоУмолчанию = СвойстваПредопределенныхМетрик();
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Метрики.Ссылка,
		|	Метрики.ПериодЗамеров = 0 КАК ПустойПериод,
		|	Метрики.МинимальныйМасштаб = 0 КАК ПустойМасштаб,
		|	ВЫРАЗИТЬ(Метрики.Описание КАК СТРОКА(100)) = """" КАК ПустоеОписание
		|ИЗ
		|	Справочник.Метрики КАК Метрики
		|ГДЕ
		|	Метрики.ИмяПредопределенныхДанных <> """"");
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СвойстваМетрики = СвойстваМетрикПоУмолчанию.Получить(Выборка.Ссылка);
		Если СвойстваМетрики = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		МетрикаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Если Выборка.ПустойПериод Тогда
			МетрикаОбъект.ПериодЗамеров = СвойстваМетрики.ЧастотаЗамеров;
		КонецЕсли;

		Если Выборка.ПустойМасштаб Тогда
			МетрикаОбъект.МинимальныйМасштаб = 1;
		КонецЕсли;

		МетрикаОбъект.Выражение = СвойстваМетрики.Выражение;

		Если Выборка.ПустоеОписание Тогда
			МетрикаОбъект.Описание = СвойстваМетрики.Описание;
		КонецЕсли;

		ОбновлениеИнформационнойБазы.ЗаписатьДанные(МетрикаОбъект);
	КонецЦикла;
	
КонецПроцедуры

// Возвращает свойства предопределенных метрик ЧастотаЗамеров и Описание
// 
Функция СвойстваПредопределенныхМетрик() Экспорт
	
	// Заполнение настроек метрик
	СвойстваМетрик = Новый Соответствие;
	
	Метрика = Справочники.Метрики.ОперативнаяОчередь;
	Свойства = СвойстваПредопределеннойМетрики();
	Свойства.ЧастотаЗамеров = 10;
	Свойства.Описание = НСтр("ru = 'Количество записей в оперативной очереди обновления прав доступа'");
	Свойства.Выражение =
		"Если Не ПолучитьФункциональнуюОпцию(""ДокументооборотИспользоватьОтложенноеОбновлениеПравДоступа"") Тогда
		|	Результат = Неопределено;
		|КонецЕсли;
		|Результат = РегистрыСведений.ОчередьОбновленияПравДоступа.РазмерОчереди(1);";
	СвойстваМетрик[Метрика] = Свойства;
	
	Метрика = Справочники.Метрики.ДолгаяОчередь;
	Свойства = СвойстваПредопределеннойМетрики();
	Свойства.ЧастотаЗамеров = 10;
	Свойства.Описание = НСтр("ru = 'Количество записей в долгой очереди обновления прав доступа'");
	Свойства.Выражение =
		"Если Не ПолучитьФункциональнуюОпцию(""ДокументооборотИспользоватьОтложенноеОбновлениеПравДоступа"") Тогда
		|	Результат = Неопределено;
		|КонецЕсли;
		|Результат = РегистрыСведений.ОчередьОбновленияПравДоступа.РазмерОчереди(2);";
	СвойстваМетрик[Метрика] = Свойства;
	
	Метрика = Справочники.Метрики.АктивныеПользователи;
	Свойства = СвойстваПредопределеннойМетрики();
	Свойства.ЧастотаЗамеров = 60;
	Свойства.Описание = НСтр("ru = 'Количество одновременно работающих пользователей программы'");
	Свойства.Выражение =
		"Сеансы = ПолучитьСеансыИнформационнойБазы();
		|Результат = Сеансы.Количество();";
	СвойстваМетрик[Метрика] = Свойства;
	
	Метрика = Справочники.Метрики.АктивностьПользователей;
	Свойства = СвойстваПредопределеннойМетрики();
	Свойства.ЧастотаЗамеров = 1440;
	Свойства.Описание = НСтр("ru = 'Количество записей в протоколе работы сотрудников за последние сутки'");
	Свойства.Выражение =
		"Запрос = Новый Запрос(
			|	""ВЫБРАТЬ
			|	|	ЕстьNull(КОЛИЧЕСТВО(ПротоколРаботыСотрудников.Дата), 0) КАК КолЗаписей
			|	|ИЗ
			|	|	РегистрСведений.ПротоколРаботыСотрудников КАК ПротоколРаботыСотрудников
			|	|ГДЕ
			|	|	ПротоколРаботыСотрудников.Дата >= &ДатаСуткиНазад"");
			|Запрос.УстановитьПараметр(""ДатаСуткиНазад"", ТекущаяДата() - 86400);
			|Выборка = Запрос.Выполнить().Выбрать();
			|Выборка.Следующий();
			|Результат = Выборка.КолЗаписей;";
	СвойстваМетрик[Метрика] = Свойства;
	
	Метрика = Справочники.Метрики.АктивныеПроцессы;
	Свойства = СвойстваПредопределеннойМетрики();
	Свойства.ЧастотаЗамеров = 60;
	Свойства.Описание = НСтр("ru = 'Количество активных процессов'");
	Свойства.Выражение =
		"Запрос = Новый Запрос(
			|	""ВЫБРАТЬ
			|	|	ЕСТЬNULL(КОЛИЧЕСТВО(ДанныеБизнесПроцессов.БизнесПроцесс), 0) КАК КолПроцессов
			|	|ИЗ
			|	|	РегистрСведений.ДанныеБизнесПроцессов КАК ДанныеБизнесПроцессов
			|	|ГДЕ
			|	|	НЕ ДанныеБизнесПроцессов.ПометкаУдаления
			|	|	И НЕ ДанныеБизнесПроцессов.Завершен
			|	|	И ДанныеБизнесПроцессов.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияБизнесПроцессов.Активен)"");
			|Выборка = Запрос.Выполнить().Выбрать();
			|Выборка.Следующий();
			|Результат = Выборка.КолПроцессов;";
	СвойстваМетрик[Метрика] = Свойства;
	
	Метрика = Справочники.Метрики.НевыполненныеЗадачи;
	Свойства = СвойстваПредопределеннойМетрики();
	Свойства.ЧастотаЗамеров = 60;
	Свойства.Описание = НСтр("ru = 'Количество невыполненных задач'");
	Свойства.Выражение =
		"Запрос = Новый Запрос(
			|	""ВЫБРАТЬ
			|	|	ЕСТЬNULL(КОЛИЧЕСТВО(ЗадачаИсполнителя.Ссылка), 0) КАК КолЗадач
			|	|ИЗ
			|	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
			|	|ГДЕ
			|	|	НЕ ЗадачаИсполнителя.ПометкаУдаления
			|	|	И НЕ ЗадачаИсполнителя.Выполнена
			|	|	И ЗадачаИсполнителя.ТекущийИсполнитель <> НЕОПРЕДЕЛЕНО"");
			|Выборка = Запрос.Выполнить().Выбрать();
			|Выборка.Следующий();
			|Результат = Выборка.КолЗадач;";
	СвойстваМетрик[Метрика] = Свойства;
	
	Метрика = Справочники.Метрики.РазмерФайлов;
	Свойства = СвойстваПредопределеннойМетрики();
	Свойства.ЧастотаЗамеров = 1440;
	Свойства.Описание = НСтр("ru = 'Суммарный размер всех файлов'");
	Свойства.Выражение =
		"Запрос = Новый Запрос(
			|	""ВЫБРАТЬ
			|	|	ЕстьNull(СУММА(ВерсииФайлов.Размер), 0) КАК Размер
			|	|ИЗ
			|	|	Справочник.ВерсииФайлов КАК ВерсииФайлов"");
			|Результат = Запрос.Выполнить();
			|Выборка = Результат.Выбрать();
			|Выборка.Следующий();
			|Результат = Выборка.Размер / (1024 * 1024);";
	СвойстваМетрик[Метрика] = Свойства;
	
	Метрика = Справочники.Метрики.Файлы;
	Свойства = СвойстваПредопределеннойМетрики();
	Свойства.ЧастотаЗамеров = 1440;
	Свойства.Описание = НСтр("ru = 'Количество файлов'");
	Свойства.Выражение =
		"Запрос = Новый Запрос(
			|	""ВЫБРАТЬ
			|	|	ЕстьNull(КОЛИЧЕСТВО(Файлы.Ссылка), 0) КАК КолФайлов
			|	|ИЗ
			|	|	Справочник.Файлы КАК Файлы"");
			|Выборка = Запрос.Выполнить().Выбрать();
			|Выборка.Следующий();
			|Результат = Выборка.КолФайлов;";
	СвойстваМетрик[Метрика] = Свойства;
	
	Метрика = Справочники.Метрики.Контрагенты;
	Свойства = СвойстваПредопределеннойМетрики();
	Свойства.ЧастотаЗамеров = 1440;
	Свойства.Описание = НСтр("ru = 'Количество контрагентов'");
	Свойства.Выражение =
		"Запрос = Новый Запрос(
			|	""ВЫБРАТЬ
			|	|	ЕстьNull(КОЛИЧЕСТВО(Контрагенты.Ссылка), 0) КАК КолЗаписей
			|	|ИЗ
			|	|	Справочник.Контрагенты КАК Контрагенты
			|	|ГДЕ
			|	|	НЕ Контрагенты.ПометкаУдаления"");
			|Выборка = Запрос.Выполнить().Выбрать();
			|Выборка.Следующий();
			|Результат = Выборка.КолЗаписей;";
	СвойстваМетрик[Метрика] = Свойства;
	
	Возврат СвойстваМетрик;
	
КонецФункции

Функция СвойстваПредопределеннойМетрики()
	
	Возврат Новый Структура("ЧастотаЗамеров, Описание, Выражение");
	
КонецФункции

#КонецОбласти

#КонецЕсли
